In [5]:
import numpy as np
import pandas as pd

In [12]:
df1=pd.DataFrame({'A':[1,2,3],'B':[4,5,6]}, index=[19,20,21])
df2=pd.DataFrame({'C':['a','b','c'],'D':['d','e','f']}, index=[20,21,22])

In [13]:
df2

    C  D
20  a  d
21  b  e
22  c  f

In [7]:
df1

    A  B
20  a  d
21  b  e
22  c  f

df2

In [9]:
df2

    A  B
20  a  d
21  b  e
22  c  f

In [10]:
df1

    A  B
19  1  4
20  2  5
21  3  6

In [11]:
pd.concat([df1,df2])

    A  B
19  1  4
20  2  5
21  3  6
20  a  d
21  b  e
22  c  f

In [14]:
pd.concat([df1,df2])

      A    B    C    D
19  1.0  4.0  NaN  NaN
20  2.0  5.0  NaN  NaN
21  3.0  6.0  NaN  NaN
20  NaN  NaN    a    d
21  NaN  NaN    b    e
22  NaN  NaN    c    f

In [15]:
pd.concat([df1,df2], axis=1)

      A    B    C    D
19  1.0  4.0  NaN  NaN
20  2.0  5.0    a    d
21  3.0  6.0    b    e
22  NaN  NaN    c    f

In [16]:
df1.join(df2)

    A  B    C    D
19  1  4  NaN  NaN
20  2  5    a    d
21  3  6    b    e

In [17]:
df2.join(df1)

    C  D    A    B
20  a  d  2.0  5.0
21  b  e  3.0  6.0
22  c  f  NaN  NaN

In [18]:
df1.join(df2,how='outer')

      A    B    C    D
19  1.0  4.0  NaN  NaN
20  2.0  5.0    a    d
21  3.0  6.0    b    e
22  NaN  NaN    c    f

In [19]:
df1.join(df2,how='outer').fillna(0)

      A    B  C  D
19  1.0  4.0  0  0
20  2.0  5.0  a  d
21  3.0  6.0  b  e
22  0.0  0.0  c  f

In [22]:
df1.join(df2,how='outer').fillna(df1['A'].mean())

      A    B    C    D
19  1.0  4.0  2.0  2.0
20  2.0  5.0    a    d
21  3.0  6.0    b    e
22  2.0  2.0    c    f

In [24]:
df1['C']=[8,10,12]
df1

    A  B   C
19  1  4   8
20  2  5  10
21  3  6  12

In [25]:
df1.loc[22]=[13,16,19]
df1

     A   B   C
19   1   4   8
20   2   5  10
21   3   6  12
22  13  16  19

In [26]:
df1['A']>2

19    False
20    False
21     True
22     True
Name: A, dtype: bool

In [27]:
df1[df1['A']>2]

     A   B   C
21   3   6  12
22  13  16  19

In [29]:
df1[(df1['A']>2)& (df1['C']>15)]

     A   B   C
22  13  16  19